// PRELIMINARY ENVELOPES ONLY. Units mm. NOT FOR FABRICATION.
$fn=32;
// CND: Конденсатор + обдув
color([0.2196078431372549, 0.7411764705882353, 0.9725490196078431]) translate([80, -500, 400]) cube([160, 1000, 550]);
// WTR: Бак холодной воды
color([0.1450980392156863, 0.38823529411764707, 0.9215686274509803]) translate([320, -480, 320]) cube([700, 450, 160]);
// ELE: Электрика и насосы
color([0.6549019607843137, 0.5450980392156862, 0.9803921568627451]) translate([380, 80, 320]) cube([420, 350, 250]);
// GBX: Штатная КПП
color([0.5803921568627451, 0.6392156862745098, 0.7215686274509804]) translate([2480, -160, 280]) cube([500, 320, 350]);
// ENG: Паровая машина
color([0.984313725490196, 0.5725490196078431, 0.23529411764705882]) translate([3000, 40, 310]) cube([600, 500, 500]);
// STM: Генератор + горелка
color([0.9372549019607843, 0.26666666666666666, 0.26666666666666666]) translate([3220, -590, 310]) cube([500, 500, 650]);
// FUE: Топливный бак
color([0.9176470588235294, 0.7019607843137254, 0.03137254901960784]) translate([2600, -590, 400]) cube([560, 300, 300]);
// RCV: Приемник конденсата
color([0.0784313725490196, 0.7215686274509804, 0.6509803921568628]) translate([2700, -180, 740]) cube([280, 350, 180]);
color([0.6,0.6,0.6,0.3]) translate([0,-745,240]) cube([8,1490,500]);
color([0.6,0.6,0.6,0.3]) translate([3765,-745,240]) cube([8,1490,500]);
color([0.6,0.6,0.6,0.2]) translate([0,-745,240]) cube([3765,1490,8]);
color([0.6,0.6,0.6,0.12]) translate([1100,-620,330]) cube([1370,1240,970]);
color([0.2,0.2,0.2]) translate([800,-615,280]) rotate([90,0,0]) cylinder(r=280,h=145,center=true);
color([0.2,0.2,0.2]) translate([800,615,280]) rotate([90,0,0]) cylinder(r=280,h=145,center=true);
color([0.2,0.2,0.2]) translate([2960,-615,280]) rotate([90,0,0]) cylinder(r=280,h=145,center=true);
color([0.2,0.2,0.2]) translate([2960,615,280]) rotate([90,0,0]) cylinder(r=280,h=145,center=true);